[
  {
    "image": "https://i.ibb.co.com/hxbGKFTm/icon-005.webp",
    "title": "Forest: Focus for Productivity",
    "companyName": "PixelWave Ltd.",
    "id": 1,
    "description": "Forest: Focus for Productivity is an innovative app designed to enhance your focus and boost productivity through a unique, gamified approach. Ideal for students, professionals, or anyone seeking to minimize distractions, it uses a virtual tree-planting system to encourage focused work sessions. Start a timer to grow a tree, and if you stay on task without using your phone, your tree flourishes; otherwise, it withers. The app’s Pomodoro-inspired timers allow customizable work and break intervals to suit your workflow, promoting sustained concentration. Build a virtual forest to visualize your productivity, with each tree representing a completed focus session. Forest’s intuitive interface makes it easy for beginners, while advanced features like task categorization and focus analytics cater to power users. Sync progress across devices with cloud integration, ensuring seamless access whether at home or on the go. Offline mode allows uninterrupted focus sessions anywhere, and gamified rewards, like unlocking new tree species, keep you motivated. Forest also supports team challenges, letting you collaborate with friends or colleagues to grow shared forests, fostering accountability. Regular updates add new features, such as ambient sounds for focus or productivity tips, to enhance your experience. Its lightweight design ensures smooth performance, even on older devices, and a vibrant community shares strategies and inspiration. Whether you’re studying, working on projects, or tackling daily tasks, Forest transforms productivity into an engaging, rewarding experience, helping you stay focused, manage time effectively, and achieve your goals with clarity and motivation.",
    "size": 45,
    "reviews": 1245,
    "ratingAvg": 4.5,
    "downloads": 500000,
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 76 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 390 },
      { "name": "5 star", "count": 524 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gFtN1TvJ/icon-006.webp",
    "title": "SmPlan: ToDo List with Reminder",
    "companyName": "NextGen Apps",
    "id": 2,
    "description": "SmPlan: ToDo List with Reminder is your ultimate tool for organizing tasks and staying on top of your schedule with ease and efficiency. Perfect for students, professionals, or anyone managing a busy life, it offers intuitive features to create detailed to-do lists, set priorities, and receive timely reminders to ensure you never miss a deadline. Categorize tasks by projects, add subtasks, and customize notifications to fit your needs, keeping you focused and organized. SmPlan’s clean, user-friendly interface simplifies task management, while its smart analytics provide insights into your productivity habits, helping you optimize your time. Sync tasks across devices with cloud integration, ensuring your plans are accessible anywhere, from your desk to on the go. Collaborate with teams by sharing lists, assigning tasks, and tracking progress in real-time, making it ideal for group projects. Offline mode ensures uninterrupted planning, and voice input allows quick, hands-free task creation. SmPlan integrates seamlessly with calendar apps to align tasks with your schedule, while its minimalist design minimizes distractions. Gamified features, like task completion streaks and achievement badges, add motivation to your routine. Regular updates bring new tools, such as recurring task templates and productivity tips, to keep you efficient. With a vibrant community sharing strategies and inspiration, SmPlan fosters accountability and collaboration. Whether you’re managing work, personal errands, or long-term goals, SmPlan empowers you to plan smarter, stay on track, and turn your to-dos into done with confidence and clarity.",
    "size": 30,
    "reviews": 875,
    "ratingAvg": 4.3,
    "downloads": 300000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 140 },
      { "name": "4 star", "count": 250 },
      { "name": "5 star", "count": 375 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zWfyf3Rc/icon-007.webp",
    "title": "FLIP - Focus Timer for Study",
    "companyName": "ActiveNow Studio",
    "id": 3,
    "description": "FLIP - Focus Timer for Study is a powerful app designed to enhance your study sessions and boost productivity through structured focus techniques. Perfect for students, lifelong learners, or anyone aiming to master new skills, it uses customizable timers based on the Pomodoro method to promote deep concentration and effective time management. Set focused study intervals, take short breaks, and track your progress with detailed analytics that reveal your study patterns and productivity trends. FLIP’s intuitive interface makes it easy to start sessions, while features like task integration and goal-setting help you prioritize and stay motivated. Sync your study data across devices with cloud integration, ensuring seamless access whether you’re at home or in a library. Offline mode allows uninterrupted focus, and gamified elements, like study streaks and achievement badges, make learning engaging and rewarding. FLIP’s clean design minimizes distractions, and its ambient sound library creates an ideal study environment. Collaborate with study groups by sharing progress or competing in focus challenges, fostering accountability. Regular updates introduce new features, such as subject-specific timers and study tips, to keep your sessions fresh. The app’s community feature connects you with other learners for tips, motivation, and shared goals. Whether you’re preparing for exams, learning a new subject, or tackling certifications, FLIP empowers you to study smarter, stay disciplined, and achieve academic success with a user-friendly, motivating, and effective approach to time management and focused learning.",
    "size": 55,
    "reviews": 2310,
    "ratingAvg": 4.8,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 55 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 1675 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/jvQTR3R8/demo-app-1.webp",
    "title": "Pomocat - Cute Pomodoro Timer",
    "companyName": "BrightPixel Co.",
    "id": 4,
    "description": "Pomocat - Cute Pomodoro Timer is a charming productivity app that transforms your work and study sessions with adorable, cat-themed timers based on the Pomodoro technique. Perfect for students, professionals, or anyone seeking a fun way to stay focused, it encourages 25-minute focus intervals followed by short breaks to maximize efficiency. Customize timers, track tasks, and watch cute virtual cats grow as you complete sessions, adding a playful twist to productivity. The app’s intuitive interface makes it easy to start, with vibrant visuals and soothing sounds to keep distractions at bay. Sync your progress across devices with cloud integration, ensuring seamless access whether at home or on the go. Offline mode allows uninterrupted focus, and gamified rewards, like unlocking new cat characters, keep you motivated. Pomocat’s task management features let you organize to-dos, set priorities, and monitor progress with detailed analytics to optimize your workflow. Collaborate with friends or teams through shared focus challenges, fostering accountability and fun. Regular updates add new themes, sounds, and productivity tips to enhance your experience. The app’s lightweight design ensures smooth performance, and its community feature connects you with other users for tips and inspiration. Whether you’re tackling schoolwork, managing projects, or building better habits, Pomocat makes productivity delightful, engaging, and effective, helping you stay on track with a user-friendly, cat-themed approach that brings joy to every focused moment.",
    "size": 20,
    "reviews": 980,
    "ratingAvg": 4.4,
    "downloads": 450000,
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 320 },
      { "name": "5 star", "count": 375 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/cKq9sDmR/icon-009.webp",
    "title": "Time Planner: Schedule & Tasks",
    "companyName": "GlobeTrek Inc.",
    "id": 5,
    "description": "Time Planner: Schedule & Tasks is a versatile app designed to streamline your daily schedule and task management with precision and ease. Ideal for professionals, students, or anyone juggling multiple responsibilities, it offers powerful tools to create detailed schedules, organize tasks, and set reminders to stay on track. Plan your day with customizable time blocks, prioritize tasks, and integrate with your calendar for a unified view of your commitments. The app’s intuitive interface simplifies navigation, while smart analytics provide insights into your time allocation, helping you optimize productivity. Sync schedules and tasks across devices with cloud integration, ensuring access whether at work, home, or on the go. Offline mode supports uninterrupted planning, and voice input enables quick task creation. Collaborate with teams by sharing schedules, assigning tasks, and tracking progress in real-time, perfect for group projects or family planning. Time Planner’s clean design minimizes distractions, and gamified features, like task completion badges, add motivation. Regular updates introduce new tools, such as recurring schedules and productivity templates, to keep your planning dynamic. The app’s community feature connects users for tips, time management strategies, and inspiration, fostering accountability. With support for multiple languages and seamless calendar integration, Time Planner caters to a global audience. Whether you’re managing work deadlines, personal errands, or long-term goals, Time Planner empowers you to organize your time effectively, stay focused, and achieve your plans with clarity, efficiency, and confidence.",
    "size": 60,
    "reviews": 3450,
    "ratingAvg": 4.6,
    "downloads": 2500000,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 2240 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/htZY6Qd/icon-010.webp",
    "title": "Flip Clock: World Clock",
    "companyName": "WaveForm Media",
    "id": 6,
    "description": "Flip Clock: World Clock is a stylish and functional app designed to keep you connected to time zones worldwide with a sleek, retro-inspired interface. Perfect for travelers, remote workers, or anyone coordinating across multiple regions, it offers a visually appealing flip clock design to track time in various cities simultaneously. Add and customize multiple clocks for your favorite locations, with real-time updates for accurate timekeeping. The app’s intuitive interface makes it easy to set up, with features like daylight saving time adjustments, sunrise/sunset times, and time zone converters for seamless scheduling. Sync your clocks across devices with cloud integration, ensuring access whether at home or on the move. Offline mode allows time tracking without connectivity, ideal for travel, and customizable themes let you personalize the clock’s appearance. Flip Clock’s minimalist design reduces clutter, while features like alarms and reminders help you stay punctual for global meetings or events. Regular updates add new cities, widgets, and customization options to enhance your experience. The app’s community feature connects users for travel tips and time management strategies, fostering collaboration. With support for multiple languages and a lightweight design for smooth performance, Flip Clock caters to a global audience. Whether you’re planning international calls, tracking family across time zones, or staying organized on the go, Flip Clock delivers a reliable, user-friendly, and visually engaging timekeeping experience that makes managing global time effortless and enjoyable.",
    "size": 75,
    "reviews": 5670,
    "ratingAvg": 4.7,
    "downloads": 7000000,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 240 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 3780 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/bjtY489g/icon-011.webp",
    "title": "Morning Habits - Daily Routine",
    "companyName": "DevVision",
    "id": 7,
    "description": "Morning Habits - Daily Routine is a transformative app designed to help you build and maintain productive morning routines for a successful start to your day. Ideal for students, professionals, or anyone seeking to establish healthy habits, it offers tools to create personalized morning schedules, track habits, and set reminders to stay consistent. Choose from guided activities like meditation, exercise, or journaling, and customize your routine to match your goals, whether it’s boosting energy or enhancing focus. The app’s intuitive interface simplifies habit tracking, with progress analytics to monitor your consistency and motivate improvement. Sync routines across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted habit-building, and gamified rewards, like streaks and badges, make mornings engaging. Morning Habits integrates with calendar apps to align your routine with your schedule, while its clean design minimizes distractions. Regular updates add new activities, motivational quotes, and habit tips to keep your mornings fresh. The community feature connects you with others for inspiration, challenges, and shared success stories, fostering accountability. With a lightweight design and support for multiple languages, Morning Habits caters to a global audience. Whether you’re aiming to kickstart your day with exercise, mindfulness, or productivity, Morning Habits empowers you to build lasting routines with a user-friendly, motivating, and effective approach, transforming your mornings into a foundation for daily success and personal growth.",
    "size": 85,
    "reviews": 2800,
    "ratingAvg": 4.9,
    "downloads": 950000,
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 250 },
      { "name": "5 star", "count": 2365 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/j9ckCbwF/demo-app-2.webp",
    "title": "Focus Plant: Pomodoro Forest",
    "companyName": "CalmSpace Tech",
    "id": 8,
    "description": "Focus Plant: Pomodoro Forest is a delightful productivity app that combines the Pomodoro technique with a nature-inspired twist to boost your focus and motivation. Perfect for students, professionals, or anyone looking to enhance concentration, it lets you grow virtual plants by completing focused work sessions, turning productivity into a rewarding game. Set customizable Pomodoro timers for work and breaks, track tasks, and watch your virtual forest flourish as you stay on task. The app’s soothing interface, with calming visuals and sounds, creates an ideal environment for deep work. Sync your progress across devices with cloud integration, ensuring seamless access whether at home or on the go. Offline mode supports uninterrupted focus, and gamified rewards, like unlocking new plant species, keep you engaged. Focus Plant’s task management tools let you organize projects, set goals, and analyze productivity trends to optimize your workflow. Collaborate with friends or teams through shared forest challenges, fostering accountability and fun. Regular updates add new plants, themes, and productivity tips to enhance your experience. The app’s lightweight design ensures smooth performance, and its community feature connects users for tips and inspiration. Whether you’re studying for exams, tackling work projects, or building better habits, Focus Plant transforms productivity into an engaging, nature-themed journey, helping you stay focused, manage time effectively, and achieve your goals with a user-friendly, motivating, and visually appealing approach.",
    "size": 40,
    "reviews": 1620,
    "ratingAvg": 4.6,
    "downloads": 680000,
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 905 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wrztsYyr/icon-013.webp",
    "title": "Alarmy - Alarm Clock & Sleep",
    "companyName": "SmartLearn",
    "id": 9,
    "description": "Alarmy - Alarm Clock & Sleep is a dynamic app designed to revolutionize your mornings and improve your sleep with smart, engaging features. Perfect for heavy sleepers, students, or anyone aiming for better rest and punctuality, it offers customizable alarms that require tasks—like math problems, shaking your phone, or scanning a barcode—to turn off, ensuring you wake up fully. Track sleep patterns with detailed analytics, set bedtime reminders, and access soothing sleep sounds to enhance rest quality. The app’s intuitive interface simplifies alarm setup and sleep tracking, while integration with wearables provides insights into your sleep cycles. Sync data across devices with cloud integration, ensuring access at home or on the go. Offline mode supports uninterrupted use, and gamified challenges, like wake-up streaks, keep you motivated. Alarmy’s clean design minimizes distractions, and its ambient sound library creates a calming bedtime environment. Regular updates add new alarm types, sleep tips, and customization options to enhance your experience. The community feature connects users for sleep hacks and morning routine inspiration, fostering accountability. With support for multiple languages and a lightweight design, Alarmy caters to a global audience. Whether you’re striving for better sleep, waking up on time, or building a consistent morning routine, Alarmy delivers a user-friendly, effective, and engaging experience that transforms your sleep and wake-up habits, helping you start each day refreshed and ready to tackle your goals.",
    "size": 90,
    "reviews": 3200,
    "ratingAvg": 4.7,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 650 },
      { "name": "5 star", "count": 2000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/rR99Hzrz/icon-014.webp",
    "title": "To-Do List - Schedule Planner",
    "companyName": "FinTech Hub",
    "id": 10,
    "description": "To-Do List - Schedule Planner is a powerful app designed to streamline your task management and daily planning with precision and simplicity. Ideal for professionals, students, or anyone balancing multiple responsibilities, it offers intuitive tools to create to-do lists, schedule tasks, and set reminders to stay organized and on track. Prioritize tasks, categorize them by projects, and integrate with your calendar for a seamless view of your schedule. The app’s clean interface makes navigation effortless, while productivity analytics provide insights into your task completion habits, helping you optimize your workflow. Sync plans across devices with cloud integration, ensuring access whether at work, home, or on the go. Offline mode supports uninterrupted planning, and voice input enables quick task creation. Collaborate with teams or family by sharing lists and assigning tasks, perfect for group projects or household chores. To-Do List - Schedule Planner’s minimalist design reduces distractions, and gamified features, like completion badges, add motivation. Regular updates introduce new templates, recurring task options, and productivity tips to keep your planning dynamic. The community feature connects users for tips, strategies, and inspiration, fostering accountability. With support for multiple languages and seamless integration, this app caters to a global audience. Whether you’re managing work deadlines, personal errands, or long-term goals, To-Do List - Schedule Planner empowers you to stay organized, focused, and efficient, delivering a user-friendly, rewarding experience that turns your plans into reality with confidence and clarity.",
    "size": 50,
    "reviews": 6700,
    "ratingAvg": 4.4,
    "downloads": 6000000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 550 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 2550 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fGvbYx4S/icon-015.webp",
    "title": "To Do List",
    "companyName": "EpicPlay Studios",
    "id": 11,
    "description": "To Do List is a straightforward and powerful app designed to simplify task management and keep your daily responsibilities organized with ease. Perfect for students, professionals, or anyone seeking a no-fuss approach to productivity, it allows you to create, prioritize, and track to-do lists with intuitive tools tailored to your needs. Add tasks, set deadlines, and categorize them by priority or project, with customizable reminders to ensure you stay on schedule. The app’s clean, minimalist interface makes task creation and navigation effortless, while progress tracking helps you visualize your accomplishments. Sync your lists across devices with cloud integration, ensuring seamless access whether at home, work, or on the go. Offline mode supports uninterrupted task management, and voice input enables quick, hands-free entry. Collaborate with others by sharing lists for group projects or family chores, fostering teamwork and accountability. To Do List’s lightweight design ensures smooth performance, and gamified features, like task completion badges, add motivation. Regular updates introduce new organization tools, templates, and productivity tips to enhance your experience. The community feature connects users for task management strategies and inspiration, creating a supportive environment. With support for multiple languages and calendar integration, To Do List caters to a global audience. Whether you’re tackling work tasks, planning errands, or pursuing personal goals, To Do List empowers you to stay organized, focused, and productive with a user-friendly, efficient, and rewarding approach that makes task management simple and effective.",
    "size": 120,
    "reviews": 8900,
    "ratingAvg": 4.8,
    "downloads": 15000000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 650 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 5250 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ynrtYsdy/icon-016.webp",
    "title": "WaterDo: To Do List & Schedule",
    "companyName": "BodyWell Apps",
    "id": 12,
    "description": "WaterDo: To Do List & Schedule is a unique productivity app that combines task management with hydration tracking to keep you organized and healthy. Ideal for students, professionals, or anyone balancing a busy lifestyle, it offers intuitive tools to create to-do lists, schedule tasks, and set reminders, while also encouraging regular water intake with customizable hydration alerts. Organize tasks by priority or project, integrate with your calendar, and track progress with insightful analytics to optimize your productivity. The app’s playful interface makes task completion fun, with gamified features like popping water bubbles for each finished task, adding motivation to your routine. Sync tasks and hydration logs across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted planning, and voice input enables quick task creation. Collaborate with teams or family by sharing lists, perfect for group projects or household chores. WaterDo’s clean design minimizes distractions, and regular updates add new features, like habit trackers and wellness tips, to enhance your experience. The community feature connects users for productivity and hydration challenges, fostering accountability. With support for multiple languages and a lightweight design, WaterDo caters to a global audience. Whether you’re managing work, personal tasks, or wellness goals, WaterDo empowers you to stay organized, hydrated, and focused with a fun, user-friendly, and effective approach that blends productivity and health seamlessly.",
    "size": 60,
    "reviews": 2100,
    "ratingAvg": 4.5,
    "downloads": 1200000,
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 110 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1010 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/NgxJCzvc/icon-017.webp",
    "title": "Taskito: To-Do List & Planner",
    "companyName": "Talkify",
    "id": 13,
    "description": "Taskito: To-Do List & Planner is a versatile app designed to streamline your task management and daily planning with a focus on simplicity and efficiency. Perfect for professionals, students, or anyone with a busy schedule, it offers intuitive tools to create to-do lists, organize tasks by projects, and schedule your day with a timeline-based view. Set reminders, prioritize tasks, and integrate with your calendar to align plans seamlessly. Taskito’s clean, user-friendly interface makes navigation effortless, while productivity analytics track your task completion patterns, helping you optimize your workflow. Sync tasks across devices with cloud integration, ensuring access whether at work, home, or on the go. Offline mode supports uninterrupted planning, and voice input allows quick task creation. Collaborate with teams or family by sharing lists and assigning responsibilities, ideal for group projects or shared chores. Taskito’s minimalist design reduces distractions, and gamified features, like task streaks and badges, add motivation. Regular updates introduce new templates, recurring task options, and productivity tips to keep your planning dynamic. The community feature connects users for strategies, inspiration, and accountability, fostering collaboration. With support for multiple languages and seamless calendar integration, Taskito caters to a global audience. Whether you’re managing work deadlines, personal errands, or long-term goals, Taskito empowers you to stay organized, focused, and productive with a user-friendly, effective, and engaging approach that transforms your daily planning into a seamless and rewarding experience.",
    "size": 65,
    "reviews": 4700,
    "ratingAvg": 4.6,
    "downloads": 4000000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 280 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 2620 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YTVm7Vmh/icon-018.webp",
    "title": "To-do list - tasks planner",
    "companyName": "Paperless Tech",
    "id": 14,
    "description": "To-do list - tasks planner is a streamlined app designed to simplify task management and help you organize your day with clarity and efficiency. Ideal for students, professionals, or anyone seeking to stay on top of their responsibilities, it offers intuitive tools to create to-do lists, set priorities, and schedule tasks with customizable reminders to ensure nothing slips through the cracks. Categorize tasks by projects or urgency, and integrate with your calendar for a unified view of your schedule. The app’s clean, minimalist interface makes task creation and navigation effortless, while progress tracking provides insights into your productivity. Sync tasks across devices with cloud integration, ensuring seamless access at home, work, or on the go. Offline mode supports uninterrupted planning, and voice input enables quick task entry. Collaborate with others by sharing lists for group projects or family chores, fostering teamwork and accountability. To-do list - tasks planner’s lightweight design ensures smooth performance, and gamified features, like completion badges, add motivation. Regular updates introduce new organization tools, templates, and productivity tips to enhance your experience. The community feature connects users for tips, strategies, and inspiration, creating a supportive environment. With support for multiple languages and calendar integration, this app caters to a global audience. Whether you’re managing work tasks, personal errands, or long-term goals, To-do list - tasks planner empowers you to stay organized, focused, and efficient with a user-friendly, effective, and rewarding approach to task management.",
    "size": 25,
    "reviews": 1300,
    "ratingAvg": 4.4,
    "downloads": 800000,
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 480 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/KpMf3SzN/icon-019.webp",
    "title": "Disciplined - Habit Tracker",
    "companyName": "MoneyFlow",
    "id": 15,
    "description": "Disciplined - Habit Tracker is a powerful app designed to help you build and maintain positive habits with ease and accountability. Perfect for anyone aiming to improve their daily routines, achieve personal goals, or enhance productivity, it offers intuitive tools to track habits, set reminders, and monitor progress with detailed analytics. Create custom habits, from exercising to reading, and schedule them with flexible frequencies to suit your lifestyle. The app’s clean interface simplifies habit tracking, while progress charts and streak counters keep you motivated by visualizing your consistency. Sync habits across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like achievement badges, make habit-building engaging. Disciplined integrates with calendar apps to align habits with your schedule, and its minimalist design minimizes distractions. Regular updates add new features, such as habit templates and motivational quotes, to enhance your experience. The community feature connects you with others for tips, challenges, and inspiration, fostering accountability and support. With support for multiple languages and a lightweight design, Disciplined caters to a global audience. Whether you’re working on fitness, mindfulness, or productivity goals, Disciplined empowers you to stay consistent, track your progress, and build lasting habits with a user-friendly, motivating, and effective approach that transforms your daily routines into stepping stones for long-term success and personal growth.",
    "size": 35,
    "reviews": 2900,
    "ratingAvg": 4.7,
    "downloads": 1500000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1830 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/jjCZsws/icon-020.webp",
    "title": "Digital Detox: Focus & Live",
    "companyName": "Readify Inc.",
    "id": 16,
    "description": "Digital Detox: Focus & Live is a transformative app designed to help you reclaim your time, reduce screen addiction, and enhance focus for a balanced life. Perfect for students, professionals, or anyone seeking to disconnect from digital distractions, it offers tools to track and limit app usage, set focus goals, and create screen-free schedules. Monitor your screen time with detailed analytics, set daily limits for apps like social media or games, and receive reminders to stay mindful of your digital habits. The app’s intuitive interface makes it easy to customize restrictions, while focus mode blocks distracting apps during work or study sessions. Sync your settings across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted usage, and gamified rewards, like focus streaks and badges, motivate you to stay disciplined. Digital Detox’s clean design minimizes distractions, and regular updates add new features, such as mindfulness tips and usage reports, to enhance your experience. The community feature connects users for tips, challenges, and inspiration, fostering accountability. With support for multiple languages and a lightweight design, Digital Detox caters to a global audience. Whether you’re aiming to boost productivity, improve mental clarity, or enjoy more offline moments, Digital Detox empowers you to take control of your digital life with a user-friendly, effective, and rewarding approach that promotes focus, balance, and well-being.",
    "size": 85,
    "reviews": 3100,
    "ratingAvg": 4.8,
    "downloads": 2200000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 2070 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/B5G0VhQ2/icon-021.webp",
    "title": "Routine Planner, Habit Tracker",
    "companyName": "PixMix Studio",
    "id": 17,
    "description": "Routine Planner, Habit Tracker is a versatile app designed to help you create structured daily routines and build lasting habits with ease and precision. Ideal for students, professionals, or anyone seeking to enhance productivity and consistency, it offers intuitive tools to plan your day, track habits, and set reminders to stay on track. Customize schedules with time blocks for tasks, workouts, or self-care, and monitor habit progress with insightful analytics and streak counters. The app’s clean interface simplifies routine planning, while integration with calendars ensures seamless alignment with your commitments. Sync routines and habits across devices with cloud integration, ensuring access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like achievement badges, make habit-building engaging. Routine Planner, Habit Tracker’s minimalist design reduces distractions, and regular updates add new templates, motivational tips, and customization options to enhance your experience. The community feature connects users for routine ideas, challenges, and inspiration, fostering accountability. With support for multiple languages and a lightweight design, this app caters to a global audience. Whether you’re organizing your workday, building fitness habits, or pursuing personal goals, Routine Planner, Habit Tracker empowers you to stay disciplined, track progress, and create sustainable routines with a user-friendly, motivating, and effective approach that transforms your daily life into a foundation for success.",
    "size": 50,
    "reviews": 1950,
    "ratingAvg": 4.5,
    "downloads": 900000,
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 1000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/mVnMQW6L/icon-022.webp",
    "title": "Time Timer Visual Productivity",
    "companyName": "HealthyEats",
    "id": 18,
    "description": "Time Timer Visual Productivity is a dynamic app designed to enhance your focus and time management with visually intuitive timers for work, study, or daily tasks. Perfect for students, professionals, or anyone seeking to boost productivity, it features a unique visual timer that displays time as a shrinking colored disk, making it easy to track progress at a glance. Customize timers for tasks or Pomodoro-style sessions, set goals, and monitor productivity with detailed analytics to optimize your workflow. The app’s clean interface simplifies time management, while ambient sounds and visual cues create a distraction-free environment. Sync timers and tasks across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted use, and gamified features, like completion badges, add motivation. Time Timer Visual Productivity integrates with calendars to align tasks with your schedule, and its lightweight design ensures smooth performance. Regular updates add new timer styles, productivity tips, and customization options to enhance your experience. The community feature connects users for time management strategies and inspiration, fostering accountability. With support for multiple languages and accessibility features, like high-contrast visuals, this app caters to a global audience. Whether you’re studying, managing projects, or organizing your day, Time Timer Visual Productivity empowers you to stay focused, manage time effectively, and achieve your goals with a user-friendly, visually engaging, and rewarding approach.",
    "size": 48,
    "reviews": 2100,
    "ratingAvg": 4.6,
    "downloads": 1300000,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 110 },
      { "name": "3 star", "count": 220 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 1180 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/B28rNZcX/icon-023.webp",
    "title": "YourHour - ScreenTime App",
    "companyName": "SkyVision",
    "id": 19,
    "description": "YourHour - ScreenTime App is a powerful tool designed to help you manage screen time, reduce digital distractions, and reclaim control over your daily habits. Perfect for students, professionals, or anyone aiming for a balanced lifestyle, it tracks app usage, sets daily limits, and provides detailed analytics to reveal your digital patterns. Customize restrictions for apps like social media or games, and use focus mode to block distractions during work or study sessions. The app’s intuitive interface makes it easy to monitor and adjust settings, while daily reports and goal-setting features keep you motivated to reduce screen time. Sync data across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like focus streaks and badges, make digital discipline engaging. YourHour’s clean design minimizes distractions, and regular updates add new features, like mindfulness tips and usage trends, to enhance your experience. The community feature connects users for tips, challenges, and inspiration, fostering accountability. With support for multiple languages and a lightweight design, YourHour caters to a global audience. Whether you’re seeking to boost productivity, improve focus, or create healthier digital habits, YourHour empowers you to take charge of your screen time with a user-friendly, effective, and rewarding approach that promotes balance, mindfulness, and intentional use of technology in your daily life.",
    "size": 42,
    "reviews": 2400,
    "ratingAvg": 4.4,
    "downloads": 1100000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 350 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1070 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/jPTWDz9j/icon-024.webp",
    "title": "Timelog - Goal & Time Tracker",
    "companyName": "GoTransit",
    "id": 20,
    "description": "Timelog - Goal & Time Tracker is a versatile app designed to help you track time, achieve goals, and boost productivity with precision and ease. Ideal for students, professionals, or anyone pursuing personal or professional objectives, it offers tools to log time spent on tasks, set measurable goals, and monitor progress with detailed analytics. Create custom projects, track time with intuitive timers, and categorize activities to stay organized. The app’s clean interface simplifies navigation, while goal-setting features break down ambitions into actionable steps, keeping you motivated. Sync data across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like achievement badges, add motivation. Timelog integrates with calendars to align tasks with your schedule, and its lightweight design ensures smooth performance. Regular updates add new features, such as habit trackers and productivity reports, to enhance your experience. The community feature connects users for goal-setting tips, time management strategies, and inspiration, fostering accountability. With support for multiple languages and a user-friendly design, Timelog caters to a global audience. Whether you’re working on career goals, studying for exams, or tracking personal projects, Timelog empowers you to manage time effectively, stay focused, and achieve your aspirations with a clear, engaging, and rewarding approach that transforms your goals into reality.",
    "size": 70,
    "reviews": 8700,
    "ratingAvg": 4.3,
    "downloads": 10000000,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 950 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 3050 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/nNHw0nhb/icon-025.webp",
    "title": "HabitNow Daily Routine Planner",
    "companyName": "LinguaTech",
    "id": 21,
    "description": "HabitNow Daily Routine Planner is a dynamic app designed to help you build and maintain daily routines for a more productive and organized life. Perfect for students, professionals, or anyone seeking to establish consistent habits, it offers intuitive tools to create customized schedules, track habits, and set reminders to stay on course. Plan your day with flexible routines, from morning workouts to evening mindfulness, and monitor progress with insightful analytics and streak counters. The app’s clean interface simplifies routine planning, while integration with calendars ensures seamless alignment with your commitments. Sync routines across devices with cloud integration, ensuring access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like achievement badges, make habit-building engaging. HabitNow’s minimalist design reduces distractions, and regular updates add new templates, motivational tips, and customization options to enhance your experience. The community feature connects users for routine ideas, challenges, and inspiration, fostering accountability. With support for multiple languages and a lightweight design, HabitNow caters to a global audience. Whether you’re aiming to improve productivity, wellness, or personal growth, HabitNow empowers you to create sustainable routines, track progress, and achieve your goals with a user-friendly, motivating, and effective approach that transforms your daily life into a foundation for lasting success and discipline.",
    "size": 95,
    "reviews": 5200,
    "ratingAvg": 4.8,
    "downloads": 3000000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 3980 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/vvw5FcMT/icon-026.webp",
    "title": "Motivated: Habit Tracker",
    "companyName": "FurryFriends",
    "id": 22,
    "description": "Motivated: Habit Tracker is an inspiring app designed to help you build and sustain positive habits with a focus on motivation and accountability. Perfect for anyone aiming to improve their lifestyle, achieve goals, or boost productivity, it offers intuitive tools to track habits, set reminders, and monitor progress with detailed analytics. Create custom habits, like daily exercise or reading, and schedule them to fit your routine, with streak counters and progress charts to keep you engaged. The app’s clean interface simplifies habit tracking, while motivational quotes and goal-setting features inspire consistency. Sync habits across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like achievement badges, make habit-building fun and rewarding. Motivated integrates with calendars to align habits with your schedule, and its lightweight design ensures smooth performance. Regular updates add new habit templates, motivational content, and customization options to enhance your experience. The community feature connects users for tips, challenges, and inspiration, fostering a supportive environment. With support for multiple languages and a user-friendly design, Motivated caters to a global audience. Whether you’re pursuing fitness, mindfulness, or productivity goals, Motivated empowers you to stay consistent, track progress, and build lasting habits with an engaging, motivating, and effective approach that transforms your daily routines into stepping stones for personal growth.",
    "size": 45,
    "reviews": 1850,
    "ratingAvg": 4.5,
    "downloads": 750000,
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 90 },
      { "name": "3 star", "count": 230 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 980 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/QjH4n6zp/icon-027.webp",
    "title": "Listok: To do list & Notes",
    "companyName": "BlockBase",
    "id": 23,
    "description": "Listok: To do list & Notes is a versatile app designed to streamline your task management and note-taking with simplicity and efficiency. Perfect for students, professionals, or anyone juggling multiple responsibilities, it offers intuitive tools to create to-do lists, jot down notes, and organize ideas with customizable categories and tags. Set reminders, prioritize tasks, and add detailed notes with text, images, or voice input for a seamless experience. The app’s clean interface makes navigation effortless, while progress tracking and search functionality help you stay organized. Sync tasks and notes across devices with cloud integration, ensuring access at home, work, or on the go. Offline mode supports uninterrupted use, and collaboration features allow you to share lists or notes with teams or family for group projects or planning. Listok’s lightweight design ensures smooth performance, and gamified rewards, like task completion badges, add motivation. Regular updates introduce new templates, note-taking tools, and productivity tips to enhance your experience. The community feature connects users for organization strategies and inspiration, fostering accountability. With support for multiple languages and calendar integration, Listok caters to a global audience. Whether you’re managing work tasks, capturing ideas, or planning personal errands, Listok empowers you to stay organized, focused, and productive with a user-friendly, effective, and rewarding approach that combines task management and note-taking into one seamless platform.",
    "size": 80,
    "reviews": 3500,
    "ratingAvg": 4.6,
    "downloads": 2500000,
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 230 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1870 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fVLbKG0t/icon-028.webp",
    "title": "Sectograph. Day & Time planner",
    "companyName": "GreenTech",
    "id": 24,
    "description": "Sectograph. Day & Time planner is a visually stunning app designed to transform how you manage your day with a unique circular timeline for tasks and events. Perfect for professionals, students, or anyone seeking a clear overview of their schedule, it displays your day as a clock face, with tasks and appointments visually mapped for intuitive planning. Create and prioritize tasks, set reminders, and integrate with your calendar to align events seamlessly. The app’s innovative interface simplifies navigation, while analytics track your time allocation to optimize productivity. Sync schedules across devices with cloud integration, ensuring access at home or on the go. Offline mode supports uninterrupted planning, and customizable widgets provide quick schedule overviews. Sectograph’s sleek design minimizes distractions, and gamified features, like completion badges, add motivation. Regular updates introduce new visualization styles, productivity tips, and customization options to enhance your experience. The community feature connects users for time management strategies and inspiration, fostering accountability. With support for multiple languages and a lightweight design, Sectograph caters to a global audience. Whether you’re managing work deadlines, personal errands, or complex projects, Sectograph empowers you to plan your day with clarity, stay focused, and achieve your goals with a user-friendly, visually engaging, and effective approach that makes time management intuitive and rewarding.",
    "size": 52,
    "reviews": 1750,
    "ratingAvg": 4.7,
    "downloads": 900000,
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 1020 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Tqhk7WKj/icon-029.webp",
    "title": "Boosted Time Tracker",
    "companyName": "FocusWorks",
    "id": 25,
    "description": "Boosted Time Tracker is a powerful app designed to optimize your time management and boost productivity with precise tracking and insightful analytics. Ideal for students, professionals, or anyone aiming to maximize efficiency, it offers intuitive tools to log time spent on tasks, set goals, and analyze productivity patterns. Create projects, track time with customizable timers, and categorize activities to stay organized. The app’s clean interface simplifies navigation, while detailed reports help you identify time sinks and improve focus. Sync data across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like achievement badges, keep you motivated. Boosted integrates with calendars to align tasks with your schedule, and its lightweight design ensures smooth performance. Regular updates add new features, such as Pomodoro timers and productivity templates, to enhance your experience. The community feature connects users for time management tips, challenges, and inspiration, fostering accountability. With support for multiple languages and a user-friendly design, Boosted caters to a global audience. Whether you’re tackling work projects, studying, or pursuing personal goals, Boosted Time Tracker empowers you to manage time effectively, stay focused, and achieve success with a clear, engaging, and rewarding approach that transforms your productivity into measurable results.",
    "size": 38,
    "reviews": 2050,
    "ratingAvg": 4.8,
    "downloads": 850000,
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 500 },
      { "name": "5 star", "count": 1260 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Ld7SbvSQ/icon-030.webp",
    "title": "StayOff: Screen Time Control",
    "companyName": "DealZone",
    "id": 26,
    "description": "StayOff: Screen Time Control is a transformative app designed to help you manage screen time, reduce digital distractions, and foster a healthier balance in your daily life. Perfect for students, professionals, or anyone seeking to curb excessive phone use, it offers powerful tools to track app usage, set daily limits, and block distracting apps during focus periods. Monitor your screen time with detailed analytics, set personalized goals, and receive reminders to stay mindful of your digital habits. The app’s intuitive interface simplifies customization, while focus mode ensures uninterrupted work or study sessions by restricting access to selected apps. Sync settings across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like focus streaks and badges, make digital discipline engaging. StayOff’s clean design minimizes distractions, and regular updates add new features, like usage reports and mindfulness tips, to enhance your experience. The community feature connects users for tips, challenges, and inspiration, fostering accountability. With support for multiple languages and a lightweight design, StayOff caters to a global audience. Whether you’re aiming to boost productivity, improve focus, or create healthier digital habits, StayOff empowers you to take control of your screen time with a user-friendly, effective, and rewarding approach that promotes balance, mindfulness, and intentional technology use.",
    "size": 60,
    "reviews": 3900,
    "ratingAvg": 4.5,
    "downloads": 2800000,
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 900 },
      { "name": "5 star", "count": 2150 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/8DhDXXBt/icon-031.webp",
    "title": "StayFree - Screen Time",
    "companyName": "EchoAI",
    "id": 27,
    "description": "StayFree - Screen Time is a powerful app designed to help you monitor and control screen time, reduce digital distractions, and promote a balanced lifestyle. Ideal for students, professionals, or anyone aiming to manage phone usage, it offers intuitive tools to track app activity, set daily limits, and block distracting apps during work or study sessions. Detailed analytics provide insights into your screen time habits, while customizable goals and reminders help you stay mindful and focused. The app’s user-friendly interface makes it easy to adjust settings, and focus mode ensures uninterrupted productivity by restricting app access. Sync data across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like focus streaks and badges, make digital discipline engaging. StayFree’s clean design minimizes distractions, and regular updates add new features, like usage trends and mindfulness tips, to enhance your experience. The community feature connects users for tips, challenges, and inspiration, fostering accountability. With support for multiple languages and a lightweight design, StayFree caters to a global audience. Whether you’re seeking to boost productivity, improve mental clarity, or build healthier digital habits, StayFree empowers you to take control of your screen time with a user-friendly, effective, and rewarding approach that promotes balance, focus, and intentional use of technology in your daily life.",
    "size": 75,
    "reviews": 3100,
    "ratingAvg": 4.6,
    "downloads": 2200000,
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 140 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1840 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DDdnS2FX/icon-032.webp",
    "title": "SupaTask - Daily Planner, Todo",
    "companyName": "SmartLiving",
    "id": 28,
    "description": "SupaTask - Daily Planner, Todo is a dynamic app designed to streamline your daily planning and task management with simplicity and power. Perfect for professionals, students, or anyone juggling multiple responsibilities, it offers intuitive tools to create to-do lists, schedule tasks, and set reminders to stay organized and productive. Organize tasks by priority or project, integrate with your calendar, and plan your day with customizable time blocks for maximum efficiency. The app’s clean interface simplifies navigation, while productivity analytics track your task completion habits, helping you optimize your workflow. Sync plans across devices with cloud integration, ensuring seamless access at home, work, or on the go. Offline mode supports uninterrupted planning, and voice input enables quick task creation. Collaborate with teams or family by sharing lists and assigning responsibilities, ideal for group projects or household chores. SupaTask’s minimalist design reduces distractions, and gamified features, like completion badges, add motivation. Regular updates introduce new templates, recurring task options, and productivity tips to keep your planning dynamic. The community feature connects users for strategies, inspiration, and accountability, fostering collaboration. With support for multiple languages and seamless integration, SupaTask caters to a global audience. Whether you’re managing work deadlines, personal errands, or long-term goals, SupaTask empowers you to stay organized, focused, and efficient with a user-friendly, effective, and rewarding approach that transforms your daily planning into a seamless and productive experience.",
    "size": 68,
    "reviews": 2800,
    "ratingAvg": 4.5,
    "downloads": 1900000,
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 130 },
      { "name": "3 star", "count": 320 },
      { "name": "4 star", "count": 700 },
      { "name": "5 star", "count": 1560 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Nnxg75HW/icon-033.webp",
    "title": "Engross: Focus Timer & To-Do",
    "companyName": "InfoSphere",
    "id": 29,
    "description": "Engross: Focus Timer & To-Do is a robust app designed to boost your productivity by combining powerful focus timers with intuitive task management tools. Perfect for students, professionals, or anyone seeking to enhance concentration, it offers customizable Pomodoro-style timers to structure work sessions and breaks, helping you stay focused and avoid burnout. Create to-do lists, prioritize tasks, and track progress with detailed analytics to optimize your workflow. The app’s clean interface simplifies navigation, while features like task categorization and deadline reminders keep you organized. Sync tasks and timers across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted focus, and gamified rewards, like focus streaks and badges, make productivity engaging. Engross integrates with calendars to align tasks with your schedule, and its lightweight design ensures smooth performance. Regular updates add new timer styles, productivity tips, and customization options to enhance your experience. The community feature connects users for time management strategies, challenges, and inspiration, fostering accountability. With support for multiple languages and a user-friendly design, Engross caters to a global audience. Whether you’re studying, tackling work projects, or managing daily tasks, Engross empowers you to stay focused, organized, and productive with a seamless, motivating, and effective approach that combines time management and task planning into one powerful platform.",
    "size": 54,
    "reviews": 5000,
    "ratingAvg": 4.3,
    "downloads": 4000000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 1300 },
      { "name": "5 star", "count": 1900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Rk5Fwzmb/icon-034.webp",
    "title": "Stay Focused: Site/App Blocker",
    "companyName": "VisionMedia",
    "id": 30,
    "description": "Stay Focused: Site/App Blocker is a powerful app designed to help you eliminate digital distractions and boost productivity by blocking distracting apps and websites. Perfect for students, professionals, or anyone aiming to enhance focus, it allows you to set customizable restrictions for social media, games, or specific websites during work or study sessions. Track usage with detailed analytics, set daily screen time limits, and receive reminders to stay on task. The app’s intuitive interface makes it easy to configure block schedules, while focus mode ensures uninterrupted productivity by restricting access to selected apps or sites. Sync settings across devices with cloud integration, ensuring seamless access at home or on the go. Offline mode supports uninterrupted tracking, and gamified rewards, like focus streaks and badges, make discipline engaging. Stay Focused’s clean design minimizes distractions, and regular updates add new blocking options, productivity tips, and usage reports to enhance your experience. The community feature connects users for tips, challenges, and inspiration, fostering accountability. With support for multiple languages and a lightweight design, Stay Focused caters to a global audience. Whether you’re studying for exams, working on projects, or building better digital habits, Stay Focused empowers you to stay disciplined, manage distractions, and achieve your goals with a user-friendly, effective, and rewarding approach that promotes focus and productivity in a digital world.",
    "size": 120,
    "reviews": 12000,
    "ratingAvg": 4.7,
    "downloads": 20000000,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 6700 }
    ]
  }
]